rottenpotatoes/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'xudong huang'
---
  def find
    id = params[:id]
    m = Movie.find_movies_same_director(id)